#include <math.h>
#include <stdio.h>
#include <string.h>

/**************************************************************************************************

  LAYER ZERO

  FOUNDATION

.doc:
  Todo().

***************************************************************************************************/



/**************************************************************************************************
  HEADER
***************************************************************************************************/
#if !defined(FOUNDATION_HEADER)
#define FOUNDATION_HEADER

////////////////////////
// CONTEXT CRACKING
#if defined(__clang__)
  #define COMPILER_CLANG 1
  #if defined(_WIN32)
    #define OS_WIN 1
  #elif defined(__gnu_linux__)
    #define OS_LNX 1
  #elif defined(__APPLE__) && defined(__MACH__)
    #define OS_MAC 1
  #else
    #error "No operating system defined in this compiler."
  #endif
  #if defined(__amd64__)
    #define ARCH_X64 1
  #elif defined(__i386__)
    #define ARCH_X86 1
  #elif defined(__arm__)
    #define ARCH_ARM 1
  #elif defined(__aarch64__)
    #define ARCH_ARM64 1
  #else
    #error "No architecture defined in this compiler."
  #endif
#elif defined(__GNUC__)
  #define COMPILER_GCC 1
  #if defined(_WIN32)
    #define OS_WIN 1
  #elif defined(__gnu_linux__)
    #define OS_LNX 1
  #elif defined(__APPLE__) && defined(__MACH__)
    #define OS_MAC 1
  #else
    #error "No operating system defined in this compiler."
  #endif
  #if defined(__amd64__)

  #error "No context defined in this compiler."
#endif

////////////////////////
// SYNTAX SUGAR
#define null  0
#define true  1
#define false 0

#define local    static
#define global   static
#define persist  static
#define function static

#define unused(a)  ((void)a)
#define countof(a) ((int)(sizeof(a) / sizeof(*(a))))
#define cast(t, x) ((t)(x))
//.note: These were Written with a lowecase first letter because they were supposed to be more like C keywords.

#define _Glue(x, y) x##y
#define Glue(x, y) _Glue(x, y)
#define Stringify(s) #s
#define UniqueId(Name) Glue(Name, __LINE__)
#define Todo(s)

#define AssertBreak() __debugbreak();
#if defined(ENABLE_ASSERT)
  #define Assert(Expr, ...) if (!(Expr)) AssertBreak();
#else
	#define Assert()
#endif
#define StaticAssert(Expr) typedef char UniqueId(_compile_assert_afray)[(Expr) ? 1 : -1]

#define Member(t,m) (((t*)0)->m)
#define MemberOffset(t,m) IntFromPtr(&Member(t,m))

#define IntFromPtr(p) (u64)((u8*)p - (u8*)0)
#define PtrFromInt(x) (void*)((u8*)0 + (x))

#define Min(x, y)      ((x) <= (y)? (x) : (y))
#define Max(x, y)      ((x) >= (y)? (x) : (y))
#define Clamp(x, v, y) ((v) <  (x)? (x) : (y) < (v)? (y) : (v))
#define ClampNorm(x, v, y) Clamp(0, v, 1)

#define IsPowerOf2(x)     (((x) != 0) && ((x) &  ((x) - 1)) == 0)
#define AlignUpPow2(x, p) (((x) +   (p) - 1)  & ~((p) - 1))
#define AlignDoPow2(x, p)  ((x) & ~((p) - 1))
#define AlignUpPtr(p, a)   ((void *)AlignUpPow2((uintptr_t)(p), (a)))
#define AlignDoPtr(p, a)   ((void *)AlignDoPow2((uintptr_t)(p), (a)))

#define Kb(x) ((x) << 10)
#define Mb(x) ((x) << 20)
#define Gb(x) ((x) << 30)
#define Tb(x) ((x) << 40)

#define Thousand(x) (x * 1000)
#define Million(x)  (x * 1000000)
#define Billion(x)  (x * 1000000000llu)
#define Trillion(x) (x * 1000000000000llu)

#define Kilo(x) Thousand(x)
#define Mega(x) Million(x)
#define Giga(x) Billion(x)
#define Tera(x) Trillion(x)

#define Flag(n) ((1u) << n)

#define ItrNum(i, n)    for (size (i) = 0; (i) < (n); (i) += 1)
#define ItrPtr(i, s, e) for (size (i) = 0; (s) < (e); (i) += 1, (s)++)

#define V2AddComps(v1, v2) (v1).x + (v1).x, (v1).y + (v2).y
#define V2SubComps(v1, v2) (v1).x - (v1).x, (v1).y - (v2).y

#define R1AddComps(r1, r2) Todo()
#define R1SubComps(r1, r2) Todo()

#define R1Overlap(r1, r2) ((r1).Min < (r2).Max && (r2).Min < (r1).Max)
#define R2Overlap(r1, r2) ((r1.x0 < r2.x1 && r2.x0 < r1.x1) && (r1.y0 < r2.y1 && r2.y0 < r1.y1))

#define R1Contains(r, x) ((r).Min <= (x) && (x) < (r).Max)
#define R2Contains(r, v) ((r.x0 <= v.x && v.x < r.x1) && (r.y0 <= v.x && v.x < r.y1))

#define R1Len(r) ((r).Max - (r).Min)
#define R2LenComps(r) r.x1 - r.x0, r.y1 - r.y0

#define R1Mid(r) (((r).Min + (r).Max)/2)
#define R2MidComps(r) r.x0 + (r.x1 - r.x0)/2, r.y0 + (r.y1 - r.y0)/2

////////////////////////
// BASIC TYPES
typedef unsigned long long size;
typedef unsigned char      byte;

typedef unsigned char          u8;
typedef unsigned short         u16;
typedef unsigned int           u32;
typedef unsigned long long int u64;
StaticAssert(sizeof(u8)  == 1);
StaticAssert(sizeof(u16) == 2);
StaticAssert(sizeof(u32) == 4);
StaticAssert(sizeof(u64) == 8);
#define u8Max  0xFF
#define u16Max 0xFFFF
#define u32Max 0xFFFFFFFF
#define u64Max 0xFFFFFFFFFFFFFFFFllu

typedef signed char   i8;
typedef short         i16;
typedef int           i32;
typedef long long int i64;
StaticAssert(sizeof(i8)  == 1);
StaticAssert(sizeof(i16) == 2);
StaticAssert(sizeof(i32) == 4);
StaticAssert(sizeof(i64) == 8);
#define i8Min  (i8 )0x80
#define i16Min (i16)0x8000
#define i32Min (i32)0x80000000
#define i64Min (i64)0x8000000000000000llu
#define i8Max  (i8 )0x7F
#define i16Max (i16)0x7FFF
#define i32Max (i32)0x7FFFFFFF
#define i64Max (i64)0x7FFFFFFFFFFFFFFFllu

typedef char           c8;
typedef unsigned short c16;
typedef unsigned int   c32;
StaticAssert(sizeof(c8)  == 1);
StaticAssert(sizeof(c16) == 2);
StaticAssert(sizeof(c32) == 4);
#define IsSpace(c) ((c) == ' ' || (c) == '\t' || (c) == '\r')
#define IsSlash(c) ((c) == '\\' || (c) == '/')
#define IsDigit(c) ((c) >= '0' && (c) <= '9')
#define IsUpper(c) ((c) >= 'A' && (c) <= 'Z')
#define IsLower(c) ((c) >= 'a' && (c) <= 'z')
#define IsAlpha(c) (IsLower(c) || IsUpper(c))
#define ToUpper(c) (IsLower(c)? (c) + 'A'-'a' : c)
#define ToLower(c) (IsUpper(c)? (c) + 'a'-'A' : c)

typedef float  r32;
typedef double r64;
StaticAssert(sizeof(r32) == 4);
StaticAssert(sizeof(r64) == 8);
#define r32Pi    3.14159265359f
#define r32Tau   6.28318530718f
#define r32Euler 2.71828182846f
#define r64Pi    3.14159265359
#define r64Tau   6.28318530718
#define r64Euler 2.71828182846

typedef i8  b8;
typedef i16 b16;
typedef i32 b32;
typedef i64 b64;

////////////////////////
// COMPUND TYPES
typedef union _i32v2 {
  struct {
    i32 x, y;
  };
  struct {
    i32 w, h;
  };
	i32 c[2];
} i32v2;
typedef union _r32v2 {
  struct {
    r32 x, y;
  };
  struct {
    r32 w, h;
  };
	r32 c[2];
} r32v2;

typedef union _u64r1 {
  struct  {
    u64 Min, Max;
  };
  struct  {
    u64 First, AfterLast;
  };
  u64 c[2];
} u64r1;
typedef union _r32r1 {
  struct  {
    r32 Min, Max;
  };
  r32 c[2];
} r32r1;
typedef union _i32r2 {
  struct {
    i32v2 Min, Max;
  };
  struct {
    i32v2 p1, p2;
  };
  struct {
    r32 x0, y0, x1, y1;
  };
  i32v2 v[2];
  i32   c[4];
} i32r2;
typedef union _r32r2 {
  struct {
    r32v2 Min, Max;
  };
  struct {
    r32v2 p1, p2;
  };
